# 데이터 사전처리

## - 누락 데이터 처리

시계열 데이터 - fillnan or 위아래 평균 값으로 채우기

In [1]:
import seaborn as sns

df = sns.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [2]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
#deck열의 NaN 개수 계산하기
nan_deck = df['deck'].value_counts()
nan_deck

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [4]:
#deck열의 NaN 개수 계산하기
nan_deck = df['deck'].value_counts(dropna=False)
nan_deck

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [5]:
# isnull() , notnull() -- not null은 청개구리개굴개굴

In [6]:
df.notnull().head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [7]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
#NaN 값이 500개 이상인 열을 모두 삭제
#500개 안되는 열은 살아남음
df_thresh = df.dropna(axis=1, thresh=500)
df_thresh.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
df_thresh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB

In [10]:
# - age열의 NaN값 삭제하기
# how = 'any' NaN값이 하나라도 있으면 삭제
df_age = df.dropna(subset=['age'], how='any',axis=0)
df_age.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   sibsp        714 non-null    int64
 5   parch        714 non-null    int64
 6   fare         714 non-null    float64
 7   embarked     712 non-null    object
 8   class        714 non-null    category
 9   who          714 non-null    object
 10  adult_male   714 non-null    bool
 11  deck         184 non-null    category
 12  embark_town  712 non-null    object
 13  alive        714 non-null    object
 14  alone        714 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 70.2+ KB

In [11]:
df['age'].head(6)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: age, dtype: float64

In [12]:
#age열의 NaN값을 다른 나이 데이터의 평균으로 계산하기
mean_age = df['age'].mean()
df['age'].fillna(mean_age, inplace=True)
df['age'].head(6)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
Name: age, dtype: float64

In [13]:
#embark_town 829행의 nan 데이터 출력
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [14]:
df['embark_town'].value_counts(dropna=True)

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [15]:
df['embark_town'].value_counts(dropna=True).idxmax()

'Southampton'

In [16]:
most_freg = df['embark_town'].value_counts(dropna=True).idxmax()
most_freg

'Southampton'

In [17]:
#southampton : 644개로 가장 많다
df.pivot_table(index=['embark_town'],aggfunc='size')

embark_town
Cherbourg      168
Queenstown      77
Southampton    644
dtype: int64

In [18]:
df['embark_town'].fillna(most_freg, inplace=True)

In [19]:
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [20]:
df = sns.load_dataset('titanic')
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [21]:
df['embark_town'].fillna(method='ffill', inplace=True)
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

# 누락 데이터가 NaN으로 표시되지 않는 경우
df.replace('?',np.nan, inplace=True)

In [22]:
import pandas as pd
df1 = pd.DataFrame({'c1':['a','a','b','a','b'],
                    'c2':['1','1','1','2','2'],
                    'c3':['1','1','2','2','2']})
df1

  c1 c2 c3
0  a  1  1
1  a  1  1
2  b  1  2
3  a  2  2
4  b  2  2

In [23]:
df_dup = df1.duplicated() #전체 행 중 중복값 찾기
df_dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [24]:
df2 = df1.drop_duplicates()

In [25]:
df1['c2']

0    1
1    1
2    1
3    2
4    2
Name: c2, dtype: object

In [26]:
col_dup = df1['c2'].duplicated() #특정 열 중 중복값 찾기
col_dup

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [27]:
df2 = df1.drop_duplicates()
df2

  c1 c2 c3
0  a  1  1
2  b  1  2
3  a  2  2
4  b  2  2

In [28]:
df3 = df1.drop_duplicates(subset=['c2','c3'])
df3

  c1 c2 c3
0  a  1  1
2  b  1  2
3  a  2  2

# 데이터 표준화

In [29]:
#dataset 불러오기

df = pd.read_csv('/Users/shindongeun/Documents/sample_data/auto-mpg.csv'
                ,header=None)
print(df.info())
print('*'*60)
display(df.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       398 non-null    float64
 1   1       398 non-null    int64
 2   2       398 non-null    float64
 3   3       398 non-null    object
 4   4       398 non-null    float64
 5   5       398 non-null    float64
 6   6       398 non-null    int64
 7   7       398 non-null    int64
 8   8       398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB
None
************************************************************

      0  1      2      3       4     5   6  7                          8
0  18.0  8  307.0  130.0  3504.0  12.0  70  1  chevrolet chevelle malibu
1  15.0  8  350.0  165.0  3693.0  11.5  70  1          buick skylark 320
2  18.0  8  318.0  150.0  3436.0  11.0  70  1         plymouth satellite
3  16.0  8  304.0  150.0  3433.0  12.0  70  1              amc rebel sst
4  17.0  8  302.0  140.0  3449.0  10.5  70  1                ford torino

In [30]:
#열 이름을 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

In [31]:
display(df.head())

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [32]:
# 단위를 mpg에서 kpl로 변경
mpg_to_kpl = 1.60934/3.78541

#mpg열에 0.425를 곱한 결과를 새로운 열(kpl)에 추가
df['kpl']=df['mpg']*mpg_to_kpl

#kpl 열 소수점 아래 둘째자리에서 반올림
df['kpl'] = df['kpl'].round(2)
display(df.head())

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,6.80
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,7.23

# 자료형 변환

In [65]:
df = pd.read_csv('/Users/shindongeun/Documents/sample_data/auto-mpg.csv'
                ,header=None)
#열 이름을 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

print(df.dtypes)

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model year        int64
origin            int64
name             object
dtype: object

In [34]:
df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [66]:
#누락 데이터인 ? 제거
import numpy as np
df['horsepower'].replace('?',np.nan, inplace=True) # ?를 nan으로 바꿔주기
df.dropna(subset=['horsepower'],#axis=0, #axis가 0이면 행
          inplace=True) # 누락 데이터 행 삭제
df['horsepower'] = df['horsepower'].astype('float') # 문자열 -> 실수형

print(df['horsepower'].dtypes)
df['horsepower'].unique()

float64

array([130., 165., 150., 140., 198., 220., 215., 225., 190., 170., 160.,
        95.,  97.,  85.,  88.,  46.,  87.,  90., 113., 200., 210., 193.,
       100., 105., 175., 153., 180., 110.,  72.,  86.,  70.,  76.,  65.,
        69.,  60.,  80.,  54., 208., 155., 112.,  92., 145., 137., 158.,
       167.,  94., 107., 230.,  49.,  75.,  91., 122.,  67.,  83.,  78.,
        52.,  61.,  93., 148., 129.,  96.,  71.,  98., 115.,  53.,  81.,
        79., 120., 152., 102., 108.,  68.,  58., 149.,  89.,  63.,  48.,
        66., 139., 103., 125., 133., 138., 135., 142.,  77.,  62., 132.,
        84.,  64.,  74., 116.,  82.])

In [38]:
df['origin'].replace({1:'USA', 2:'EU', 3:'JAPAN'}, inplace=True)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,USA,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,USA,ford torino

In [39]:
df['origin'].unique() #유일값 찾기

array(['USA', 'JAPAN', 'EU'], dtype=object)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(5), int64(2), object(2)
memory usage: 30.6+ KB

In [41]:
df['origin'] = df['origin'].astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    category
 8   name          392 non-null    object
dtypes: category(1), float64(5), int64(2), object(1)
memory usage: 28.1+ KB

In [42]:
df['origin'] = df['origin'].astype('str')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(5), int64(2), object(2)
memory usage: 30.6+ KB

# 범주형 (카테고리) 데이터 처리

In [43]:
describe_dic = df['horsepower'].describe() # 데이터요약
describe_dic

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [44]:
describe_dic.loc['min']

46.0

In [45]:
bin_dividers = [describe_dic.loc['min'],describe_dic.loc['50%'],
               describe_dic.loc['75%'], describe_dic.loc['max']]
bin_dividers

[46.0, 93.5, 126.0, 230.0]

In [46]:
bin_names = ['저출력','보통출력','고출력'] #3개의 bin에 이름 지정

In [48]:
#pd.cut 함수로 각 데이터를 3개의 bin에 할당
df['hp_bin'] = pd.cut(x=df['horsepower'],#데이터 배열
                     bins=bin_dividers, # 경계 값 리스트
                      labels=bin_names, #bin 이름
                     include_lowest=True) # 첫 경계값 포함
df.head(30)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,hp_bin
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu,고출력
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320,고출력
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite,고출력
3,16.0,8,304.0,150.0,3433.0,12.0,70,USA,amc rebel sst,고출력
4,17.0,8,302.0,140.0,3449.0,10.5,70,USA,ford torino,고출력
5,15.0,8,429.0,198.0,4341.0,10.0,70,USA,ford galaxie 500,고출력
6,14.0,8,454.0,220.0,4354.0,9.0,70,USA,chevrolet impala,고출력
7,14.0,8,440.0,215.0,4312.0,8.5,70,USA,plymouth fury iii,고출력
8,14.0,8,455.0,225.0,4425.0,10.0,70,USA,pontiac catalina,고출력
9,15.0,8,390.0,190.0,3850.0,8.5,70,USA,amc ambassador dpl,고출력
10,15.0,8,383.0,170.0,3563.0,10.0,70,USA,dodge challenger se,고출력
11,14.0,8,340.0,160.0,3609.0,8.0,70,USA,plymouth 'cuda 340,고출력
12,15.0,8,400.0,150.0,3761.0,9.5,70,USA,chevrolet monte carlo,고출력
13,14.0,8,455.0,225.0,3086.0,10.0,70,USA,buick estate wagon (sw),고출력
14,24.0,4,113.0,95.0,2372.0,15.0,70,JAPAN,toyota corona mark ii,보통출력
15,22.0,6,198.0,95.0,2833.0,15.5,70,USA,plymouth duster,보통출력
16,18.0,6,199.0,97.0,2774.0,15.5,70,USA,amc hornet,보통출력
17,21.0,6,200.0,85.0,2587.0,16.0,70,USA,ford maverick,저출력
18,27.0,4,97.0,88.0,2130.0,14.5,70,JAPAN,datsun pl510,저출력
19,26.0,4,97.0,46.0,1835.0,20.5,70,EU,volkswagen 1131 deluxe sedan,저출력
20,25.0,4,110.0,87.0,2672.0,17.5,70,EU,peugeot 504,저출력
21,24.0,4,107.0,90.0,2430.0,14.5,70,EU,audi 100 ls,저출력
22,25.0,4,104.0,95.0,2375.0,17.5,70,EU,saab 99e,보통출력
23,26.0,4,121.0,113.0,2234.0,12.5,70,EU,bmw 2002,보통출력
24,21.0,6,199.0,90.0,2648.0,15.0,70,USA,amc gremlin,저출력
25,10.0,8,360.0,215.0,4615.0,14.0,70,USA,ford f250,고출력
26,10.0,8,307.0,200.0,4376.0,15.0,70,USA,chevy c20,고출력
27,11.0,8,318.0,210.0,4382.0,13.5,70,USA,dodge d200,고출력
28,9.0,8,304.0,193.0,4732.0,18.5,70,USA,hi 1200d,고출력
29,27.0,4,97.0,88.0,2130.0,14.5,71,JAPAN,datsun pl510,저출력

# 원 핫 인코딩

In [49]:
horsepower_dummies = pd.get_dummies(df['hp_bin'])
horsepower_dummies.head(15)

    저출력  보통출력  고출력
0     0     0    1
1     0     0    1
2     0     0    1
3     0     0    1
4     0     0    1
5     0     0    1
6     0     0    1
7     0     0    1
8     0     0    1
9     0     0    1
10    0     0    1
11    0     0    1
12    0     0    1
13    0     0    1
14    0     1    0

In [50]:
# 원핫인코딩
from sklearn import preprocessing

In [51]:
#전처리를 위한 encoding 객체 생성
label_encoder = preprocessing.LabelEncoder()
onehot_encoder = preprocessing.OneHotEncoder()

In [56]:
# label encoder로 문자열 범주를 숫자형 범주로 변환
onehot_labeled = label_encoder.fit_transform(df['hp_bin'].head(30))
onehot_labeled

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 2, 2, 2, 2, 2,
       1, 1, 2, 0, 0, 0, 0, 2])

In [57]:
#2차원 행렬로 변경
onehot_reshaped = onehot_labeled.reshape(len(onehot_labeled),1)
onehot_reshaped

array([[0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [1],
       [1],
       [1],
       [2],
       [2],
       [2],
       [2],
       [2],
       [1],
       [1],
       [2],
       [0],
       [0],
       [0],
       [0],
       [2]])

In [58]:
# 희소행렬로 변환
onehot_fitted = onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted)
print(type(onehot_fitted))

  (0, 0)	1.0
  (1, 0)	1.0
  (2, 0)	1.0
  (3, 0)	1.0
  (4, 0)	1.0
  (5, 0)	1.0
  (6, 0)	1.0
  (7, 0)	1.0
  (8, 0)	1.0
  (9, 0)	1.0
  (10, 0)	1.0
  (11, 0)	1.0
  (12, 0)	1.0
  (13, 0)	1.0
  (14, 1)	1.0
  (15, 1)	1.0
  (16, 1)	1.0
  (17, 2)	1.0
  (18, 2)	1.0
  (19, 2)	1.0
  (20, 2)	1.0
  (21, 2)	1.0
  (22, 1)	1.0
  (23, 1)	1.0
  (24, 2)	1.0
  (25, 0)	1.0
  (26, 0)	1.0
  (27, 0)	1.0
  (28, 0)	1.0
  (29, 2)	1.0
<class 'scipy.sparse._csr.csr_matrix'>

# 정규화

In [69]:
df.horsepower = df.horsepower/abs(df.horsepower.max())
print(df.horsepower.head())
print('#'*60)
print(df.info())

0    0.565217
1    0.717391
2    0.652174
3    0.652174
4    0.608696
Name: horsepower, dtype: float64
############################################################
<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 30.6+ KB
None

In [72]:
# horsepower 열의 최대값의 절대값으로 모든 데이터를 나눠서 저장
min_x = df['horsepower'] - df['horsepower'].min()
min_x

0      0.365217
1      0.517391
2      0.452174
3      0.452174
4      0.408696
         ...
393    0.173913
394    0.026087
395    0.165217
396    0.143478
397    0.156522
Name: horsepower, Length: 392, dtype: float64

In [73]:
min_max = df.horsepower.max() - df.horsepower.min()
df.horsepower = min_x/min_max

In [74]:
df.horsepower.head()

0    0.456522
1    0.646739
2    0.565217
3    0.565217
4    0.510870
Name: horsepower, dtype: float64

In [75]:
df.horsepower.describe()

count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: horsepower, dtype: float64

# 시계열 데이터

In [77]:
df_stock = pd.read_csv('/Users/shindongeun/Documents/sample_data/stock-data.csv')
df_stock.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [79]:
df_stock['new_Date']=pd.to_datetime(df_stock['Date'])
# df_stock에 새로운 열로 추가
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [80]:
df_stock.head()

         Date  Close  Start   High    Low  Volume   new_Date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26

In [81]:
# 시계열 값으로 변환된 열을 새로운 행 인덱스로 지정, 기존 날짜 열 삭제
df_stock.set_index('new_Date', inplace=True)
del df_stock['Date']
df_stock.head()

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

In [82]:
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   20 non-null     int64
 1   Start   20 non-null     int64
 2   High    20 non-null     int64
 3   Low     20 non-null     int64
 4   Volume  20 non-null     int64
dtypes: int64(5)
memory usage: 960.0 bytes

In [83]:
# 날짜 형식 문자열 리스트 정의
dates = ['2019-01-01','2020-03-01','2021-06-01']

In [84]:
#문자열 데이터(시리즈 객체)를 pandas timestamp로 변환
ts_dates = pd.to_datetime(dates)
ts_dates

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [86]:
#날짜 기준
ts_dates.to_period(freq='D')

PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]')

In [87]:
#월기준
ts_dates.to_period(freq='M')

PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]')

In [89]:
#연기준
ts_dates.to_period(freq='Y')

PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

In [90]:
#timestamp의 배열 만들기 - 월간격, 월시작일 기준
ts_ms = pd.date_range(start='2019-01-01', # 범위 시작
                    end=None, #범위 끝
                     periods=6, # 생성할 timestamp의 개수
                     freq='MS', # 시간간격(MS: 월의 시작일)
                     tz='Asia/Seoul') # 시간대(timezone)
ts_ms

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [94]:
#timestamp의 배열 만들기 - 월간격, 월말일 기준
ts_ms = pd.date_range(start='2019-01-01', # 범위 시작
                    end=None, #범위 끝
                     periods=6, # 생성할 timestamp의 개수
                     freq='M', # 시간간격(MS: 월의 시작일)
                     tz='Asia/Seoul') # 시간대(timezone)
ts_ms

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')

In [96]:
#timestamp의 배열 만들기 - 3개월 간격, 월말일 기준
ts_ms = pd.date_range(start='2019-01-01', # 범위 시작
                    end=None, #범위 끝
                     periods=6, # 생성할 timestamp의 개수
                     freq='3M', # 시간간격(MS: 월의 시작일)
                     tz='Asia/Seoul') # 시간대(timezone)
ts_ms

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

# Period 배열
period_range()

In [100]:
# period 배열 만들기 - 1개월 길이
pr_m = pd.period_range(start='2019-01-01', #범위 시작
                      end=None, #범위 끝
                      periods=3, #생성할 period 개수
                      freq='M') #기간의 길이 (M:월)
pr_m

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]')

In [101]:
# period 배열 만들기 - 2시간 길이
pr_m = pd.period_range(start='2019-01-01', #범위 시작
                      end=None, #범위 끝
                      periods=3, #생성할 period 개수
                      freq='2H') #기간의 길이 (M:월)
pr_m

PeriodIndex(['2019-01-01 00:00', '2019-01-01 02:00', '2019-01-01 04:00'], dtype='period[2H]')

# 시계열 데이터 분리
연, 월, 일 데이터에서 일부를 추가할 수 있음

In [105]:
df_stock.reset_index(inplace=True)

In [106]:
df_stock['Year']=df_stock['new_Date'].dt.year
df_stock['Month']=df_stock['new_Date'].dt.month
df_stock['Day']=df_stock['new_Date'].dt.day
df_stock.head()

    new_Date  Close  Start   High    Low  Volume  Year  Month  Day
0 2018-07-02  10100  10850  10900  10000  137977  2018      7    2
1 2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2 2018-06-28  10400  10900  10950  10150  155769  2018      6   28
3 2018-06-27  10900  10800  11050  10500  133548  2018      6   27
4 2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [107]:
df_stock['Date_yr']=df_stock['new_Date'].dt.to_period(freq='Y')
df_stock['Date_m']=df_stock['new_Date'].dt.to_period(freq='M')
df_stock.head()

,new_Date,Close,Start,High,Low,Volume,Year,Month,Day,Date_yr,Date_m
0,2018-07-02,10100,10850,10900,10000,137977,2018,7,2,2018,2018-07
1,2018-06-29,10700,10550,10900,9990,170253,2018,6,29,2018,2018-06
2,2018-06-28,10400,10900,10950,10150,155769,2018,6,28,2018,2018-06
3,2018-06-27,10900,10800,11050,10500,133548,2018,6,27,2018,2018-06
4,2018-06-26,10800,10900,11000,10700,63039,2018,6,26,2018,2018-06